app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Sigma_SIX"], ["room_number", 6456456], ["updated_at", "2018-12-17 20:27:27.129508"], ["id", 1]]
---
def update
 @school_class.update(school_class_params)

DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 7]]
---
def destroy
@school_class.destroy

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 7]]
---
def find_school_class
	@school_class = SchoolClass.find(params[:id])